package com.game.zillionaire.dialog;

public class DialogConstant {
	public static final String[][] dialogMessage={
		{"完蛋了！","人家不管啦！","惨了~","还好没事~","我是不是在做梦啊？",//前三句为倒霉语句，后面两句为幸运语句(0-4)
		 "住院x天","呜呜呜呜呜...","住院中,剩余x天","坐牢x天","人家是无辜的~","监狱中,剩余x天",//前三句为住院，后三句为坐牢(5-10)
		 "闲人止步!","有够机车!","看谁比较倒霉？","谁来接手...","小可爱去吧!",//11-12为障碍物，13-14为炸弹， 15为机器娃娃
		 "有请先人降临~","你的就是我的,我的还是我的!","步步为营~","我还不想走!","维护市容整洁,人人有责!","好国民要缴税喔~",//16-21为使用卡片
		 "此地为xx拥有,过路费为yy元。","xx住院中,免收过路费。","xx入狱中,免收过路费。","xx的旅店,进来住宿x天,共花费yy元","xx的购物中心,消费yy元","xx的加气站，加气花费yy元",//22-27为上交过路费
		 "xx买进y","xx卖出y","请你快快离开吧~","入住旅馆中......","消失中...","xx住店中，免收过路费。","xx消失中，免收过路费。"},//孙小美34
		
		{"天啊~","让我死了吧！","荷包大出血~","我是幸运女神！","今夜做梦也会笑~",//前三句为倒霉语句，后面两句为幸运语句(0-4)
		 "住院x天","真倒霉!","住院中,剩余x天","坐牢x天","我是冤枉的~","监狱中,剩余x天",//前三句为住院，后三句为坐牢(5-10)
		 "闲人止步!","有够机车!","我又要害人了~呵呵呵","谁来接手...","小可爱去吧!",//11-12为障碍物，13-14为炸弹， 15为机器娃娃
		 "有请先人降临~","你的就是我的,我的还是我的!","步步为营!","我还不想走!","维护市容整洁,人人有责!","好国民要缴税喔~",//16-21为使用卡片
		 "此地为xx拥有,过路费为yy元。","xx住院中,免收过路费。","xx入狱中,免收过路费。","xx的旅店,进来住宿x天,共花费yy元","xx的购物中心,消费yy元","xx的加气站，加气花费yy元",//22-27为上交过路费
		 "xx买进y","xx卖出y","请你快快离开吧","入住旅馆中......","消失中...","xx住店中，免收过路费。","xx消失中，免收过路费。"},//金贝贝34
			
		{"真的假的？！","这没什么！","怎么会这样？？？","老天保佑！","福气呀！",//前三句为倒霉语句，后面两句为幸运语句(0-4)
		 "住院x天","哎哟喂呀~","住院中,剩余x天","坐牢x天","冤枉啊！","监狱中,剩余x天",//前三句为住院，后三句为坐牢(5-10)
		 "给我站住","有够机车","看谁比较倒霉？","谁来接手...","小可爱去吧!",//11-12为障碍物，13-14为炸弹， 15为机器娃娃
		 "有请先人降临~","你的就是我的,我的还是我的!","步步为营!","我还不想走!","维护市容整洁,人人有责~","好国民要缴税喔~",//16-21为使用卡片
		 "此地为xx拥有,过路费为yy元。","xx住院中,免收过路费。","xx入狱中,免收过路费。","xx的旅店,进来住宿x天,共花费yy元","xx的购物中心,消费yy元","xx的加气站，加气花费yy元",//22-27为上交过路费
		 "xx买进y","xx卖出y","请你快快离开吧","入住旅馆中......","消失中...","xx住店中，免收过路费。","xx消失中，免收过路费。"}//阿土伯34
	};
	public static final String[] MeetPWord={"大财神显灵，免收过路费！","大福神显灵，买地免费！盖房加倍!!",
			"土地公显灵，强占土地！","小财神显灵，过路费减半！","小天使显灵，多盖一层！",
			"小福神显灵，多盖一层！","小穷神显灵，多收一半过路费！","大穷神显灵，多收一倍过路费！","小衰神显灵，盖房失败！",
			"大衰神显灵，盖房失败！","小恶魔显灵，拆毁一层！"};//语句10
}
